Repository: SecSign/SecSign-ID-Typo3-Plugin
Catalog: Resources/Private/Language/locallang.xlf
Languages: de

# msg_SESSION_STATE_DENIED
source: Access Pass denied! Please restart login or contact the administrator, if you did not denie the login.
de: Access Pass abgelehnt! Bitte starten Sie den Login erneut oder kontaktieren Sie den Admin, wenn Sie den Login nicht abgelehnt haben

# msg_SESSION_STATE_SUSPENDED
source: Session supsended! Please restart login.
de: Session aufgehoben! Bitte starten Sie den Login neu.

# msg_SESSION_STATE_INVALID
source: Invalid session! Please restart login.
de: Ungültige Session! Bitte starten Sie den Login neu.

# msg_SESSION_STATE_EXPIRED
source: Session expired! Please restart login.
de: Session abgelaufen! Bitte starten Sie den Login neu.

# secsign_msg_wrong_password
source: Wrong password or username!
de: Falsches Passwort oder Benutzername

# msg_ERROR_LOGIN
source: Error occured during operation. Try again or contact administrator.
de: Fehler während Ausführung aufgetreten. Versuchen Sie es erneut oder kontaktieren Sie den Administrator.

# msg_ALREADY_EXISTS_ADMIN
source: The automatic SecSign ID for you already exists. Please contact the Administrator.
de: Die automatisch gewählte SecSign ID existiert bereits. Bitte kontaktieren Sie Ihren Administrator.

# msg_SECSIGNID_EXISTS
source: The chosen SecSign ID already exists.
de: Die gewählte SecSign ID existiert bereits.

# msg_SECSIGNID_NOT_EXISTS
source: The chosen SecSign ID does not exists.
de: Die gewählte SecSign ID existiert nicht.

# msg_SECSIGNID_DUPLICATE
source: The chosen SecSign ID already belongs to another user.
de: Die gewählte SecSign ID ist bereits einem anderen Nutzer zugeordnet.

# msg_FIDO_ERROR
source: Error on authentication with FIDO. Try again.
de: Fehler bei der Authentifizierung mit FIDO. Versuchen Sie es erneut.

source: Username:
de: Benutzername:

# msg_NO_USER
source: No User for authed SecSign ID found! Please retry!
de: Kein Benutzer zur authentifzierten SecSign ID gefunden! Bitte versuchen Sie es erneut!

# secsign.login.username.label
source: Username
de: Benutzername

# secsign.login.password.label
source: Password
de: Passwort

# secsign.accesspass.for.text
source: Access pass for
de: Access Pass für

# secsign.button.cancel
source: Cancel
de: Abbrechen

# secsign.activate.twofa.heading
source: Activate Two-Factor-Authentication
de: Aktiviere Zwei-Faktor-Authentifizierung

# secsign.activate.twofa.start
source: Complete the following steps to activate the two-factor authentication for your account.
de: Befolgen Sie die nachfolgenden Schritte, um die Zwei-Faktor-Authentifizierung für Ihren Account zu aktivieren.

# secsign.activate.twofa.1
source: 1. Download the SecSign ID App for your Two-Factor-Authentication:
de: 1. Laden Sie die SecSign ID App f\u00FCr ihre Zwei Faktor Authentifizierung runter:

# secsign.activate.twofa.2
source: 2. Scan the QR-Code.
de: 2. Scannen Sie den QR-Code.

# secsign.activate.twofa.qr
source: Your individual QR-Code:
de: Ihr persönlicher QR-Code:

# secsign.activate.twofa.qr.desktop
source: Use Desktop App
de: Benutze Desktop App

# secsign.activate.twofa.qr.continue
source: The authentication will resume automatically after scanning the QR-Code and creation of the SecSign ID.
de: Die Authentifzierung wird automatisch fortgeführt, nachdem der QR-Code gescannt und die ID erstellt wurde.

# secsign.activate.mail
source: Your E-Mail-address:
de: Ihre E-Mail-Adresse:

# secsign.activate.twofa.3
source: 3. Enter the confirmation code sent to your Email-address in the SecSign ID app
de: 3. Geben Sie den Bestätigungs-Code, den Sie per Mail erhalten, in der SecSign App ein.

# secsign.activate.twofa.3.important
source: Important:
de: Wichtig:

# secsign.activate.twofa.3.spam
source: The Email may take a couple of minutes. If you did not receive the code, please check your SPAM-folder.
de: Es kann einige Minuten dauern, bis der Bestätigungscode in Ihrem Postfach eingeht. Sollten Sie keinen Code erhalten, sehen Sie in Ihrem SPAM-Ordner nach.

# secsign.activate.twofa.3.end
source: Entering the code is the final step of the setup. Your ID is now ready to use. The authentication will resume automatically.
de: Nachdem Sie den Code in der App eingegeben haben, ist die Einrichtung abgeschlossen und Ihre SecSign ID erstellt.

# secsign.create.text.1
source: This system uses two-factor authentication.
de: Das System nutzt eine Zwei-Faktor Authentifizierung.

# secsign.create.text.2
source: To use the two-factor authentication you need a SecSign ID. You have not linked a SecSign ID to your account yet. In the following step you can add an ID to your account.
de: F\u00fcr die Zwei-Faktor Authentifizierung ben\u00f6tigen Sie eine SecSign ID. Sie haben noch keine SecSign ID eingetragen und jetzt die M\u00f6glichkeit eine ID f\u00fcr Sie zu erstellen und hinzuzuf\u00fcgen.

# secsign.create.text.3
source: After creating your SecSign ID you will be presented with a QR code. Please scan this code with your SecSign ID app to activate the ID in the app. You can then use the ID to log in.
de: Anschlie\u00dfend bekommen Sie einen QR-Code angezeigt, welchen Sie mit der SecSignID-App scannen k\u00f6nnen und so ihre neue ID in ihrer App hinzuf\u00fcgen k\u00f6nnen. Danach k\u00f6nnen Sie sich mit dieser ID anmelden und die ID f\u00fcr zukunftige Logins nutzen. Wenn Sie abbrechen, werden Sie nicht eingeloggt und bekommen beim n\u00e4chsten Versuch erneut die M\u00f6glichkeit eine ID hinzuzuf\u00fcgen.

# secsign.create.already.link
source: I already created a SecSign ID
de: Ich habe bereits eine SecSign ID erstellt.

# secsign.create.new.field
source: New SecSign ID
de: Neue SecSign ID

# secsign.create.new.button
source: Create new ID
de: Erstelle neue SecSign ID

# secsign.add.text.1
source: This system uses two-factor authentication.
de: Das System nutzt eine Zwei-Faktor Authentifizierung.

# secsign.add.text.2
source: To use the two-factor authentication you need a SecSign ID. You have not linked a SecSign ID to your account yet. In the following step you can add an ID to your account.
de: Für die Zwei-Faktor Authentifizierung benötigen Sie eine SecSign ID. Sie haben noch keine SecSign ID eingetragen und jetzt die Möglichkeit eine ID für Sie hinzuzufügen.

# secsign.add.text.3
source: You can then use this ID to log in. If you cancel the procedure you will not be logged in and you can add an ID with your next login with your username and password.
de: Anschließend bekommen Sie die Möglichkeit sich mit dieser ID anzumelden. Wenn Sie abbrechen, werden Sie nicht eingeloggt und bekommen beim nächsten Versuch erneut die Möglichkeit eine ID hinzuzufügen.

# secsign.add.create.link
source: I didn't create a SecSign ID yet
de: Ich habe noch keine ID erstellt.

# secsign.add.add.field
source: Your SecSign ID
de: Ihre SecSign ID

# secsign.add.add.button
source: Add ID
de: ID Hinzufügen

# secsignid.login.methodselect.default.title
source: Authentication Method
de: Authentifizierungs-Methode

# secsignid.login.methodselect.default.subtitle
source: Select an authentication method to continue.
de: W\u00e4hlen Sie eine Authentifizierungs-Methode, um fortzufahren.

# secsignid.login.methodselect.id.description
source: Login by authenticating with the SecSign ID using your mobile or desktop SecSign ID app.
de: Authentifizieren Sie sich beim Anmelden einfach \u00fcber die sichere SecSign ID.

# secsignid.login.methodselect.totp.title
source: Authenticator-App
de: Authentifizierungs-App

# secsignid.login.methodselect.totp.description
source: Login by authenticating with an OTP generated by an Authenticator-App (e.g. Google Authenticator)
de: Sie erhalten beim Anmelden ein Einmal-Code an Ihre Authentifizierungs-App und m\u00f6ssen diesen eingeben.

# secsignid.login.methodselect.fido.description
source: Log in by authenticating with your FIDO-Authenticator. Multiple FIDO-Authenticator can be registered.
de: Melden Sie sich \u00fcber eine Authentifizierung mit dem FIDO-Authenticator an. Es k\u00f6nnen mehrere FIDO-Authenticator registriert werden.

# secsignid.login.methodselect.mail.description
source: Login by authenticating with an Email OTP sent to your Email address
de: Sie erhalten beim Anmelden ein Einmal-Code an Ihre E-Mail Adresse und m\u00f6ssen diesen eingeben.

# secsignid.login.methodselect.new.title
source: Active other login option
de: Aktivieren anderer Authentifizierung.

# secsignid.login.methodselect.new.description
source: Activate other authentication methods which can be also used to authenticate yourself.
de: Aktivieren Sie eine andere Authentifizierungs-Methode, welche dann zum Authentifizieren genutzt werden kann.

# secsignid.login.methodselect.inactive.subtitle
source: Select an authentication method which you want to setup after sign-in.
de: W\u00e4hlen Sie eine Authentifizierungs-Methode , welche Sie einrichten wollen.

# secsignid.login.methodselect.inactive.title
source: Select a new authentication method
de: W\u00e4hlen Sie eine neue Authentifizierungs-Methode.

# secsignid.login.methodselect.active.subtitle
source: Select an authentication method which you want to use to authenticate yourself before setting up the new authentication method.
de: \u00e4hlen Sie eine Authentifizierungs-Methode, welche Sie zur Authentifizierung nutzen wollen, bevor Sie die neue Methode aktivieren.

# secsignid.login.methodselect.active.title
source: Authentication
de: Authentifizierung

# secsignid.login.fido.auth.subheading
source: Authenticate with a security key, for example the Yubikey
de: Authentifizieren Sie sich mit einem Sicherheitsschl\u00fcssel, beispielsweise dem Yubikey.

# secsignid.login.fido.auth.text
source: Press the "Authenticate with FIDO-Authenticator" button to start the authentication process with your FIDO-Authenticator.
de: Starten Sie den Authentifizierungsprozess mit Ihrem FIDO-Authenticator, indem Sie \u201cMit FIDO-Authenticator authentifizieren\u201d ausw\u00e4hlen.

# secsignid.login.fido.auth.button
source: Authenticate with FIDO-Authenticator
de: Mit FIDO Authenticator authentifizieren

# secsignid.login.fido.hint
source: Connect your security key (for example the Yubikey) to your computer or mobile device or hold it against the RFID reader of your device, or use a Platform-Authenticator (e.g. TouchID, FaceID or Windows Hello). Click continue when your browser asks you about permission for using the authenticator.
de: Verbinden Sie Ihren Sicherheitsschl\u00fcssel (beispielsweise der Yubikey) mit Ihrem Computer oder mobilen Endger\u00e4t, oder halten Sie es gegen das RFID Leseger\u00e4t. Klicken Sie auf \u201cWeiter\u201d, wenn die Meldung zur Nutzung des Sicherheitsschl\u00fcssels auf Ihrem Ger\u00e4t erscheint.

# secsignid.login.fido.register.subheading
source: Register a new security key, for example the Yubikey, or use a available Platform-Authenticator (e.g. TouchID, FaceID or Windows Hello)
de: Registrieren Sie einen neuen Sicherheitsschl\u00FCssel, beispielsweise den Yubikey, oder einen Plattform-Authentikator (z.B. TouchID, FaceID oder Windows Hello).

# secsignid.login.fido.register.text
source: Before you can authenticate yourself with a FIDO-Authenticator it needs to be registered first.
de: Sie m\u00fcssen den FIDO-Authenticator registrieren, bevor Sie sich damit authentifizieren k\u00f6nnen.

# secsignid.login.fido.register.label
source: Enter a name for the FIDO-Authenticator to identify it after the registration.
de: Geben Sie einen Namen f\u00fcr den FIDO-Authenticator an, um ihn nach der Registrierung identifizieren zu k\u00f6nnen.

# secsignid.login.fido.register.button
source: Register FIDO-Authenticator
de: FIDO-Authenticator registrieren

# secsignid.login.fido.register.input.hint
source: e.g. My Yubikey
de: Zum Beispiel: My Yubikey

# secsignid.button.next
source: Next
de: Weiter

# secsign.login.mailotp.code.label
source: Please enter Code
de: Bitte Code eingeben

# secsign.login.mailotp.text
source: Please enter the OTP here to verify your login for:
de: Bitte geben Sie das OTP ein, um den Login zu verifzieren f\u00fcr:

# secsign.login.totp.text
source: Please enter the OTP here to verify your login for:
de: Bitte geben Sie das OTP ein, um den Login zu verifzieren f\u00fcr:

# secsign_msg_wrong_totp
source: Wrong TOTP, please try again!
de: Falsches TOTP, bitte versuchen Sie es erneut!

# secsign.login.totp.code.label
source: Please enter Code
de: Bitte Code eingeben

# secsign.login.totp.register.subheading
source: Scan the QR-Code
de: Scannen Sie den QR-Code

# secsign.login.totp.register.text.1
source: Use a Authenticator-App (Google Authenticator, Authy, etc.) to scan the QR-Code.
de: Nutzen Sie Ihre Authentifizierungs-App (Google Authenticator, Authy, etc.) um den QR-Code einzuscannen.

# secsign.login.totp.register.text.2
source: After scanning the QR code, click "Next".
de: Nachdem Sie den QR-Code eingescannt haben, klicken Sie auf "Weiter".

# secsign.login.totp.register.code.link
source: Cant scan QR-Code?
de: QR-Code nicht sichtbar?

# secsign.login.totp.register.code.text
source: Code for Desktop Apps:
de: Code für Desktop Apps:

# secsignid.buttons.back.name
source: Back
de: Zurück
